type numbersList = {
    [index: string]: string;
}

const uaNumbers: numbersList = {
    '0': '',
    '1': 'один',
    '2': 'два',
    '3': 'три',
    '4': 'чотири',
    '5': "п'ять",
    '6': 'шість',
    '7': 'сім',
    '8': 'вісім',
    '9': "дев'ять",
    '10': 'десять',
    '11': 'одинадцять',
    '14': 'чотирнадцять',
    '15': "п'ятнадцять",
    '16': 'шістнадцять',
    '19': "дев'ятнадцять",
    '20': 'двадцять',
    '30': 'тридцять',
    '40': 'сорок',
    '50': "п'ятдесят",
    '60': 'шістдесят',
    '70': 'сімдесят',
    '80': 'вісімдесят',
    '90': "дев'яносто",
    '100': 'сто',
    '200': 'двісті',
    '300': 'триста',
    '400': 'чотириста',
    '500': "п'ятсот",
    '600': "шістсот",
    '900': "дeв'ятсот",
}

const uaThousands = {
    1: 'одна',
    2: 'дві',
}

export { uaNumbers, uaThousands };
